In [1]:
import pandas as pd

## Series

In [14]:
obj = pd.Series([4,7,-5,3])
obj.index = [0,1,5,3]
obj

0    4
1    7
5   -5
3    3
dtype: int64

In [7]:
#Series 생성 2
obj2 = pd.Series([4,7,-5,3], index = ['d', 'b', 'a', 'c'])
obj2.index= ['a', 'b', 'c', 'd']
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [20]:
#값 확인(values)
print(obj2.values) #numpy 배열
print(obj2.index)
print(obj2.dtype)

[ 4  7 -5  3]
Index(['a', 'b', 'c', 'd'], dtype='object')
int64

In [19]:
x = pd.Series([9904312, 3448737, 2890451,2466052], index = ['서울', '부산', '인천', '대구'])
x

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [22]:
# Seires의 이름, index의 이름
x.name= '인구'
x.index.name = '도시'
x

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [27]:
# Series연산
print(x/1000000)
print(x>2500000)

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64
도시
서울     True
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [33]:
# Series 인덱싱
print(x[1],x['부산'])
print(x[3],x['대구'])
print(x[[0,3,1]])

3448737 3448737
2466052 2466052
도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [37]:
# Series boolean 색인
print(x[x >= 2500000])
print(x[(x >= 2500000) & (x<=5000000)])

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64
도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [39]:
# Series 슬라이싱
print(x[1:3])
print(x['부산': '대구'])

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64
도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [41]:
#Series 생성 (딕셔너리)
data = {'서울':9631482, '부산':3393191, '인천':2632035, '대전':1490158}
s2 =pd.Series(data)
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [43]:
# Series[index]- Series[index] 
# index가 일치해야 연산가능 안될경우 NaN
ds = x -s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [47]:
print(ds.notnull())
print(ds[ds.notnull()])

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [48]:
print(ds.isnull())
print(ds[ds.isnull()])

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool
대구   NaN
대전   NaN
dtype: float64

In [62]:
rs = (x-s2)/s2*100
print(rs[rs.notnull()])

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [63]:
rs['부산']= 1.6
rs['대구'] = 1.41
del rs['서울']
rs['광주'] = 2.5
rs

대구    1.410000
대전         NaN
부산    1.600000
인천    9.818107
광주    2.500000
dtype: float64

## DataFrame

In [68]:
# dataframe 생성
data1 = {"2015": [9904312, 3448737, 2890451, 2466052], "2010": [9631482, 3393191, 2632035, 2431774]}
df = pd.DataFrame(data1)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [70]:
# df index 교체
df.index= ['서울', '부산', '인천', '대구']
df.name='인구'
df.index.name = '도시'
df

       2015     2010
도시
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [75]:
data1 = [[9904312, 3448737, 2890451, 2466052],[9631482, 3393191, 2632035, 2431774]] #2행 4열
index = ['2015', '2010']
col = ['서울', '부산', '인천', '대구']
df2 = pd.DataFrame(data1, index, col)
# 행과 열 변경
df2.T

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [82]:
data2_list = [[175.3,180.2,178.6],[66.2,78.9,55.1],[27,49,35]]
ind = ['키','몸무게', '나이']
col = ['홍길동', '김사또', '임꺽정']
df3_list = pd.DataFrame(data2_list, ind, col)
df3_list

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

In [83]:
data2 = {"홍길동":[175.3,66.2,27], "김사또":[180.2,78.9,49], "임꺽정":[178.6,55.1,35]}
df3 = pd.DataFrame(data2)
df3.index = ['키', '몸무게', '나이']
df3

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

In [87]:
# DataFrame 요소 확인
print(df.values)
print(df.index)
print(df.columns)

[[9904312 9631482]
 [3448737 3393191]
 [2890451 2632035]
 [2466052 2431774]]
Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')
Index(['2015', '2010'], dtype='object')

In [91]:
df['2015'] #하나의 dataframe은 여러개의 Series형태로 구성

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [95]:
df[['2015']]
df[['2010','2015']]

       2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [96]:
# 2005 컬럼명으로 2005년 인구수 대입
df['2005'] = [9762546,3512547,2517680,2456016]
df

       2015     2010     2005
도시
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [135]:
df[0:1]
df['서울':'인천']
# df['서울'] 에러
df[['2015','2010']]['서울':'부산']

# loc[] : 실제 인덱스를 사용하여 행을 가지고 올 때 사용 , df.loc[행,열]
df.loc['서울'] #인덱스 접근시 Series
df.loc['서울':,'2010':] # 슬라이싱 접근시 DataFrame, 시작점 생략가능

# iloc[] : numpy의 array 인덱싱 방식으로 행을 가지고 올 때 사용, df.iloc[행,열] <- 인덱스 번호(0~)
df.iloc[0] #인덱스 접근시 Series
df.iloc[:4,1:3] # 슬라이싱 접근시 DataFrame, 시작점 생략가능

#2010년 데이터 중에서 250만 이상인 데이터만 추출
df[df['2010']>=2500000].loc[:,'2010':'2010']

       2010
도시
서울  9631482
부산  3393191
인천  2632035

## .csv 불러오기

In [2]:
population_number = pd.read_csv('data/population_number.csv', encoding='euc-kr', index_col = '도시' )
population_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [11]:
population_number.count()
population_number['2005'].value_counts()

9762546.0    1
2456016.0    1
Name: 2005, dtype: int64

In [8]:
population_number.isnull()

       지역   2015   2010   2005   2000
도시
서울  False  False  False  False  False
부산  False  False   True   True  False
인천  False  False  False   True  False
대구  False  False  False  False  False

In [10]:
s2 = pd.Series([1,2,3,4,5,6,7,8,15,2,4,6,8])
s2.value_counts()

8     2
6     2
4     2
2     2
15    1
7     1
5     1
3     1
1     1
dtype: int64

In [6]:
# value 기준 정렬
population_number['2010'].sort_values()
population_number['2010'].sort_values(ascending=False) #내림차순
population_number.sort_values(by='2010') #특정 열을 기준으로 정렬
population_number.sort_values(by=['지역','2010'])

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

In [7]:
score = pd.read_csv('data/score.csv', encoding = 'euc-kr', index_col = '과목')
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [9]:
# 학급별 총계
score.sum()
# 학급별 순위
score.sum().sort_values(ascending = False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [10]:
score.loc[:,:'4반']

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [11]:
#과목별 합계를 컬럼에 추가
score['합계'] = score.loc[:,:'4반'].sum(axis=1)
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [12]:
#과목별 평균을 컬럼에 추가
score['평균'] = score.loc[:,:'4반'].mean(axis=1)
score

    1반  2반  3반  4반   합계     평균
과목
수학  45  44  73  39  201  50.25
영어  76  92  45  69  282  70.50
국어  47  92  45  69  253  63.25
사회  92  81  85  40  298  74.50
과학  11  79  47  26  163  40.75

In [13]:
# 반별 평균을 컬럼에 추가
score.loc['반평균'] = score.loc[:,:'4반'].mean()
score

       1반    2반    3반    4반     합계     평균
과목
수학   45.0  44.0  73.0  39.0  201.0  50.25
영어   76.0  92.0  45.0  69.0  282.0  70.50
국어   47.0  92.0  45.0  69.0  253.0  63.25
사회   92.0  81.0  85.0  40.0  298.0  74.50
과학   11.0  79.0  47.0  26.0  163.0  40.75
반평균  54.2  77.6  59.0  48.6    NaN    NaN

In [16]:
# 결측치 채우기, 컬럼만 따로 가능
score.fillna(value = 0, inplace=True)
score

       1반    2반    3반    4반     합계     평균
과목
수학   45.0  44.0  73.0  39.0  201.0  50.25
영어   76.0  92.0  45.0  69.0  282.0  70.50
국어   47.0  92.0  45.0  69.0  253.0  63.25
사회   92.0  81.0  85.0  40.0  298.0  74.50
과학   11.0  79.0  47.0  26.0  163.0  40.75
반평균  54.2  77.6  59.0  48.6    0.0   0.00

In [17]:
#컬럼별로 가장 큰값, 가장 작은 값
print(score.max())
print(score.min())

1반     92.0
2반     92.0
3반     85.0
4반     69.0
합계    298.0
평균     74.5
dtype: float64
1반    11.0
2반    44.0
3반    45.0
4반    26.0
합계     0.0
평균     0.0
dtype: float64

In [18]:
#행별로 가장 큰값, 가장 작은 값
print(score.max(axis=1))
print(score.min(axis=1))

과목
수학     201.0
영어     282.0
국어     253.0
사회     298.0
과학     163.0
반평균     77.6
dtype: float64
과목
수학     39.0
영어     45.0
국어     45.0
사회     40.0
과학     11.0
반평균     0.0
dtype: float64

In [22]:
# 반평균, 합계, 평균을 제외한 데이터중 과목별 가장 큰 값, 작은 값을 구하세요
print(score.loc[:'과학',:'4반'].max(axis=1))
print(score.loc[:'과학',:'4반'].min(axis=1))

과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64
과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64

In [23]:
#과목별 가장 큰 값, 작은 값의 차를 구하세요.
print(score.loc[:'과학',:'4반'].max(axis=1) - score.loc[:'과학',:'4반'].min(axis=1))

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

In [24]:
# apply변환 : 행이나 열 단위로 더 복잡한 처리를 하고 싶을 때 사용, DataFrame.apply(func, axis=0)
def max_min(x):
    return x.max()-x.min()

In [25]:
score.loc[:'과학',:'4반'].apply(max_min, axis=1)

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

In [28]:
# 카테고리 나누기
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
bins = [-1, 15, 25, 35, 60, 100]
lb = ['미성년자', '청년', '중년', '장년', '노년']

In [29]:
pd.cut(ages, bins, labels =lb)

['미성년자', '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', '노년']
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [30]:
cats = pd.cut(ages, bins, labels =lb)

In [31]:
print(cats)
print(type(cats))
print(cats.categories)

['미성년자', '미성년자', '미성년자', '청년', '청년', ..., '노년', '청년', '장년', '중년', '노년']
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']
<class 'pandas.core.arrays.categorical.Categorical'>
Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [33]:
data = {'ages':ages, 'cats':cats}
age_df = pd.DataFrame(data)
age_df

    ages  cats
0      0  미성년자
1      2  미성년자
2     10  미성년자
3     21    청년
4     23    청년
5     37    장년
6     31    중년
7     61    노년
8     20    청년
9     41    장년
10    32    중년
11   100    노년

In [34]:
age_df['cats'].value_counts()

청년      3
미성년자    3
노년      2
장년      2
중년      2
Name: cats, dtype: int64

In [36]:
df1 = pd.Series([275,260,250], index=['유재석', '신동엽', '강호동'])
df1.name = '발사이즈'
df1

유재석    275
신동엽    260
강호동    250
Name: 발사이즈, dtype: int64

In [39]:
df2 = pd.Series([250,245], index=['송은이', '김숙'])
df2.name = '발사이즈'
df2

송은이    250
김숙     245
Name: 발사이즈, dtype: int64

In [40]:
df3 = pd.concat([df1,df2])
df3

유재석    275
신동엽    260
강호동    250
송은이    250
김숙     245
Name: 발사이즈, dtype: int64

In [41]:
df4 = pd.Series([0.2,1.8,1.5], index=['유재석', '신동엽', '강호동'])
df4.name = '시력'
df4

유재석    0.2
신동엽    1.8
강호동    1.5
Name: 시력, dtype: float64

In [42]:
df5 = pd.concat([df1,df4], axis=1)
df5

     발사이즈   시력
유재석   275  0.2
신동엽   260  1.8
강호동   250  1.5

In [43]:
# del df5['시력'] -> 컬럼 삭제
df5.drop('신동엽', inplace= True)

In [44]:
df5

     발사이즈   시력
유재석   275  0.2
강호동   250  1.5

### 2015-2017년 광주광역시 범죄현황 데이터를 이용해 전년 대비 범죄 증감율을 구하라

In [70]:
df_2015 = pd.read_csv('data/2015.csv', encoding = 'euc-kr', index_col = '관서명')
df_2016 = pd.read_csv('data/2016.csv', encoding = 'euc-kr', index_col = '관서명')
df_2017 = pd.read_csv('data/2017.csv', encoding = 'euc-kr', index_col = '관서명')

In [56]:
df_2015

            구분  살인  강도  강간·강제추행    절도     폭력
관서명
광주지방경찰청계  발생건수  18  44      750  8425   9593
광주지방경찰청계  검거건수  18  47      758  5409   8301
광주지방경찰청계  검거인원  17  66      776  3433  11774
광주지방경찰청계    구속   9  33       42   104     58
광주지방경찰청계   불구속   1  26      511  2781   5618
광주지방경찰청계    기타   7   7      223   548   6098
광주동부경찰서   발생건수   3   5       92  1100   1155
광주동부경찰서   검거건수   4   6       86   583    970
광주동부경찰서   검거인원   4   7       98   447   1483
광주동부경찰서     구속   3   2        8    13     10
광주동부경찰서    불구속   0   4       63   379    703
광주동부경찰서     기타   1   1       27    55    770
광주서부경찰서   발생건수   5  10      172  2050   2483
광주서부경찰서   검거건수   4   8      153  1471   2124
광주서부경찰서   검거인원   4  15      167   876   3080
광주서부경찰서     구속   3  10        7    27     19
광주서부경찰서    불구속   0   5       91   665   1366
광주서부경찰서     기타   1   0       69   184   1695
광주남부경찰서   발생건수   1   3       70   962   1081
광주남부경찰서   검거건수   1   3       53   506    941
광주남부경찰서   검거인원   1   3       52   418   1260
광주남부경찰서     구속   0   3        3    19      3
광주남부경찰서    불구속   1   0       39   325    675
광주남부경찰서     기타   0   0       10    74    582
광주북부경찰서   발생건수   5  14      256  2570   2621
광주북부경찰서   검거건수   5  18      212  1852   2319
광주북부경찰서   검거인원   5  28      216   948   3168
광주북부경찰서     구속   3  11       11    30     10
광주북부경찰서    불구속   0  12      153   770   1544
광주북부경찰서     기타   2   5       52   148   1614
광주광산경찰서   발생건수   4  12      160  1743   2253
광주광산경찰서   검거건수   4  10      135   996   1922
광주광산경찰서   검거인원   3   8      129   736   2585
광주광산경찰서     구속   0   4        5    12      6
광주광산경찰서    불구속   0   4       81   639   1181
광주광산경찰서     기타   3   0       43    85   1398

In [74]:
df_2015_total = df_2015[df_2015['구분'] == '발생건수'].loc[:,'살인':].sum(axis=1)
df_2015_total.name = '2015총계'

In [73]:
df_2016_total = df_2016[df_2016['구분'] == '발생건수'].loc[:,'살인':].sum(axis=1)
df_2016_total.name = '2016총계'
df_2016_total

관서명
광주지방경찰청계    15416
광주동부경찰서      2068
광주서부경찰서      3892
광주남부경찰서      1865
광주북부경찰서      4148
광주광산경찰서      3443
Name: 2016총계, dtype: int64

In [81]:
df_2017_total = df_2017[df_2017['구분'] == '발생건수'].loc[:,'살인':].sum(axis=1)
df_2017_total.drop('광주지방경찰청', inplace= True)
df_2017_total.name = '2017총계'

In [82]:
df_15_16 = (df_2016_total - df_2015_total)/df_2015_total*100
df_15_16.name = '2015-2016증감율'
df_16_17 = (df_2017_total - df_2016_total)/df_2016_total*100
df_16_17.name = '2016-2017증감율'

In [83]:
total = pd.concat([df_2015_total,df_15_16,df_2016_total,df_16_17,df_2017_total], axis = 1)
total

          2015총계  2015-2016증감율  2016총계  2016-2017증감율  2017총계
관서명
광주지방경찰청계   18830    -18.130643   15416     -9.516087   13949
광주동부경찰서     2355    -12.186837    2068    -13.007737    1799
광주서부경찰서     4720    -17.542373    3892     -6.526208    3638
광주남부경찰서     2117    -11.903637    1865    -17.050938    1547
광주북부경찰서     5466    -24.112697    4148     -4.893925    3945
광주광산경찰서     4172    -17.473634    3443    -12.285797    3020